<?php

use Illuminate\Database\Seeder;

class StartingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        /*
        |--------------------------------------------------------------------------
        | Create Roles
        |--------------------------------------------------------------------------
        */
        #1.Create Admin
        app('db')->table('roles')->insert([
            'name'          =>  'admin',
            'persianName'   =>  'ادمین'
        ]);
        #2.Create Admin
        app('db')->table('roles')->insert([
            'name'          =>  'normalUser',
            'persianName'   =>  'کاربر عادی'
        ]);
        #3.Create Admin
        app('db')->table('roles')->insert([
            'name'          =>  'freeTrialUser',
            'persianName'   =>  'کاربر با اشتراک رایگان'
        ]);
        /*
        |--------------------------------------------------------------------------
        | Create Users
        |--------------------------------------------------------------------------
        */
        #1.Create Admin User
        'App\User'::create([
            'FullName'      => 'ادمین سایت',
            'phoneNumber'   =>  '09102222222',
            'role_id'       =>  1,
            'freeTime'      =>  null,
        ]);
        #2.Create Normal User
        'App\User'::create([
            'FullName'      => 'کاربر عادی',
            'phoneNumber'   =>  '09102222222',
            'role_id'       =>  2,
            'freeTime'      =>  null,
        ]);
        #3.Create Free Trial User
        'App\User'::create([
            'FullName'      => 'کاربر با اشتراک رایگان',
            'phoneNumber'   =>  '09102222222',
            'role_id'       =>  3,
            'freeTime'      =>  null,
        ]);
        /*
        |--------------------------------------------------------------------------
        | Create Category
        |--------------------------------------------------------------------------
        */
        #1.Binary
        'App\Category'::create([
            'name'  =>  'باینری آپشن'
        ]);
        #2.Forex
        'App\Category'::create([
            'name'  =>  'فارکس'
        ]);
        /*
        |--------------------------------------------------------------------------
        | Create Sub Category
        |--------------------------------------------------------------------------
        */
        #2.Verify-Binary
        'App\SubCategory'::create([
            'name'          =>  'وریفای',
            'category_id'   =>  1
        ]);
        #2.Meta Traider-Binary
        'App\SubCategory'::create([
            'name'          =>  'متاریدر',
            'category_id'   =>  1
        ]);
        #2.Reforms-Binary
        'App\SubCategory'::create([
            'name'          =>  'اصلاحات',
            'category_id'   =>  1
        ]);
        #2.Deal-Binary
        'App\SubCategory'::create([
            'name'          =>  'معاملات',
            'category_id'   =>  1
        ]);
        /*########### Forex ########### */
        #2.Verify-Forex
        'App\SubCategory'::create([
            'name'          =>  'وریفای',
            'category_id'   =>  2
        ]);
        #2.Meta Traider-Forex
        'App\SubCategory'::create([
            'name'          =>  'متاریدر',
            'category_id'   =>  2
        ]);
        #2.Reforms-Forex
        'App\SubCategory'::create([
            'name'          =>  'اصلاحات',
            'category_id'   =>  2
        ]);
        #2.Deal-Forex
        'App\SubCategory'::create([
            'name'          =>  'معاملات',
            'category_id'   =>  2
        ]);
        /*
        |--------------------------------------------------------------------------
        | Create Articles
        |--------------------------------------------------------------------------
        */
        #1.Article-Binary-Verify
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی وریفای-بانری آپشن',
            'subCategory_id'    =>  1,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);
        #2.Article-Binary-Meta Traider
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی متاتریدر-باینری آپشن',
            'subCategory_id'    =>  2,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);
        #3.Article-Binary-Reforms
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی اصلاحات-باینری آپشن',
            'subCategory_id'    =>  3,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);
        #4.Article-Binary-Deal
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی معاملات-باینری آپشن',
            'subCategory_id'    =>  4,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);
        #5.Article-Forex-Verify
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی وریفای-فارکس',
            'subCategory_id'    =>  5,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);
        #6.Article-Forex-Meta Traider
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی متاتریدر-فارکس',
            'subCategory_id'    =>  6,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);
        #7.Article-Forex-Reforms
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی اصلاحات-فارکس',
            'subCategory_id'    =>  7,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);
        #8.Article-Forex-Deal
        'App\Article'::create([
            'title'             =>  'مقاله ساختگی معاملات-فاکس',
            'subCategory_id'    =>  8,
            'body'              =>  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
        ]);




    }
}
